{"Hyperhidrosis": [{"title": "Random pep talk/rant?", "url": "https://www.reddit.com/r/Hyperhidrosis/comments/1h438mr/random_pep_talkrant/", "score": "11", "subreddit": "Hyperhidrosis", "media_url": "", "thumbnail": "self", "post_hint": "", "author": "sweatyextrovert", "num_comments": 4, "created_utc": 1733059585.0, "selftext": "Hi everyone, this is my first ever Reddit post (I know, I'm pretty late to the game). I just wanted to let everyone know that you're doing great surviving with this condition. I've had severe hyperhidrosis all my life on my hands and feet. I inherited the gene from my parent that I never met, so the rest of my family had no clue what to do. Even worse, my doctor barely believed me, but after a couple years of complaining, referred me to my dermatologist which introduced me to aluminum chloride and iontopherosis. Unfortunately, aluminum chloride didn't work on me, but after sorting out insurance stuff, I just got my Dermadry. I'm going to try it out soon. I have high hopes. To be blunt, I'm so done with the bullshit that comes with this stupid condition, and I think we can all agree, the effects go way deeper than others might think. I have plenty of stories from when I was younger that I can rant about, and will probably end up posting about, but for now, I want everyone to hear this: that no matter how embarrassed, humiliated, or insecure you feel, you're doing everything you can to live with it. If you're a student, like me, who feels burnt out just from trying to write on paper which will result in making entire puddles on your notebook. Or if you're sick of shaking people's hands, high fives, and don't get me started on the constant \"dap me up\"s I had to deal with during high school. (Don't know how my friends tolerated it). Or, if you have experienced moments where people will straight up yell, \"WHY ARE YOUR HANDS SO SWEATY?\" in a nearly silent room. Or maybe you just can't stand how you leave traces of sweat on every surface you put your hand on. All of these situations are challenges that others have never had to deal with. We have been forced to adapt and try to conceal the fact that we're different. Every day, we stress ourselves out, and go to such extreme lengths to make everyone else feel comfortable, and at times, for us just to function. But you guys, I'm so proud of you for pushing through and just continuing to fake it til you make it. And for everyone who already found the cure that works for them, I'm jealous! You're a step ahead! Whoever's reading this, I just hope that you know all your stories, thoughts, and feelings are so valid. They're your own personal experiences that can never quite be fully understood by someone else. You're constantly growing and learning more about your own hyperhidrosis, and I believe that it will get better, even if you feel like nothing has worked so far. I hope you feel proud of yourself for everything you've accomplished. Keep your head up, because you have been able to overcome so many obstacles. Please recognize that you're strong, and go easy on yourself. It's easy to get mad at ourselves when we keep running into more and more problems caused by our hyperhidrosis. But seriously, give yourself a break, and appreciate the fact that you have still accomplished so many things despite this condition. To be honest, I have to tell myself that all the time, because no one else will. A lot of the people around us will never understand how it impacts our day to day lives. I'm super excited to try my Dermadry, and I have high hopes that it will work after a few weeks. If anyone wants updates, I'll make another post. Thanks for reading this whole rant thing, and love you all :)", "is_self": true}, "2024-12-01T19:18:11.054704"], "ITCareerQuestions": [{"title": "I have notice this strange team dynamic: why are some people allowed to make mistakes and others don’t, and are even expected to be perfect at the first attempt? ", "url": "https://www.reddit.com/r/ITCareerQuestions/comments/1h3qo5m/i_have_notice_this_strange_team_dynamic_why_are/", "score": "61", "subreddit": "ITCareerQuestions", "media_url": "", "thumbnail": "", "post_hint": "", "author": "Ancient-Tangelo-1351", "num_comments": 28, "created_utc": 1733012967.0, "selftext": "I know that someone in my team was told ‘or you reach the 80% rate of tickets resolution within the next 3 months or you are fired. Another colleague who was constantly below minimum (60%) was instead got to explore some different aspects of the role other than tickets and got promoted as an SME instead? ", "is_self": true}, "2024-12-01T19:18:14.034337"], "MovieSuggestions": [{"title": "Movies involving sentient robots in similar tone as Wall-e, The Wild Robot?", "url": "https://www.reddit.com/r/MovieSuggestions/comments/1h434yn/movies_involving_sentient_robots_in_similar_tone/", "score": "11", "subreddit": "MovieSuggestions", "media_url": "", "thumbnail": "self", "post_hint": "", "author": "zxof", "num_comments": 51, "created_utc": 1733059240.0, "selftext": "My 6 year old seems to really enjoy \"sentient robot\" movies, so far he really enjoy these movies, anything else to suggest? Thank you very much! \n\n* Finch\n* Wall-e\n* The Wild Robot", "is_self": true}, "2024-12-01T19:18:17.232578"], "AJelqForYou": [{"title": "Anti lox alternatives as king chatgpt in comparison to rat lox ved study", "url": "https://www.reddit.com/r/AJelqForYou/comments/1h44y5b/anti_lox_alternatives_as_king_chatgpt_in/", "score": "4", "subreddit": "AJelqForYou", "media_url": "", "thumbnail": "", "post_hint": "", "author": "CashPuzzleheaded5178", "num_comments": 2, "created_utc": 1733064855.0, "selftext": "Estimating the potential enhancement in lengthening using silibinin, heparin cream, minoxidil with DMSO and eucalyptus oil, and a VED device compared to a VED alone involves combining insights from studies and the mechanisms of these compounds. Here’s a detailed breakdown:\n\nHigh enough dose 50-70% more gains in comparison to bapn 112% more \n\n---\n\n1. Baseline: VED Alone\n\n8.2% increase in penile length as observed in the rat study.\n\n\n\n---\n\n2. VED + BAPN (LOX Inhibition): 17.4%\n\nRepresents a 2.12-fold increase in gains due to the addition of a direct LOX inhibitor.\n\n\n\n---\n\n3. Mechanisms of the Proposed Regimen\n\nSilibinin (2000 mg/day systemically):\n\nAntifibrotic and LOX Modulation: Silibinin has been shown to reduce LOX expression and collagen cross-linking in fibrotic tissues, mimicking a systemic LOX inhibitory effect, albeit weaker than BAPN.\n\nEstimated LOX inhibition efficacy: ~50–60% of BAPN based on preclinical antifibrotic data.\n\n\nTopical Heparin Cream (60,000 IU):\n\nLocalized LOX Inhibition: Heparin provides direct LOX inhibition at the site of application, though it is less potent than BAPN. Combined with the mechanical stress of VED, it could amplify ECM remodeling.\n\nEstimated LOX inhibition efficacy: ~30–50% of BAPN in the applied area.\n\n\nMinoxidil (5%) with DMSO and Eucalyptus Oil:\n\nTissue Softening and Angiogenesis: Minoxidil promotes vascularization, enhances skin plasticity, and indirectly supports ECM remodeling.\n\nPenetration Enhancement: DMSO and eucalyptus oil ensure deeper penetration of minoxidil, further enhancing its local effects on the penile tissue.\n\n\n\n\n---\n\n4. Predicted Synergistic Effects\n\nGiven the mechanisms:\n\nSystemic silibinin could achieve partial systemic LOX inhibition (~50% efficacy of BAPN).\n\nHeparin and minoxidil (topical) act locally to complement the systemic effects and enhance ECM remodeling under mechanical stress.\n\nCombined Impact: The regimen likely provides an additive effect by targeting LOX from systemic and local pathways and improving tissue pliability through angiogenesis and hydration.\n\n\n\n---\n\n5. Estimated Lengthening Gains\n\nTo estimate the overall enhancement:\n\nVED + BAPN: 2.12x gain compared to VED alone (8.2% → 17.4%).\n\nProposed Regimen: Likely less potent than BAPN but additive effects could approach 1.5x to 1.7x the gains of VED alone.\n\n\nCalculation:\n\nVED Alone: 8.2% increase.\n\nVED + Regimen:  total increase.\n\n\n\n---\n\n6. Summary\n\nUsing silibinin, heparin, minoxidil, DMSO, and eucalyptus oil with a VED could potentially increase lengthening gains to 12.3–13.9% compared to 8.2% with VED alone. This represents a 1.5- to 1.7-fold enhancement in the lengthening rate.\n\n\n---\n\n7. Considerations\n\nIndividual Variability: Response depends on tissue composition, skin permeability, and adherence to the regimen.\n\nSafety: Ensure no adverse effects from systemic silibinin, anticoagulant effects of heparin, or irritation from DMSO.\n\nConsistency: Regular application and consistent VED use are crucial for maximizing results.\n\n\nFurther empirical testing (animal or clinical studies) would validate these estimates.\n\n", "is_self": true}, "2024-12-01T19:20:09.662010"], "ArtificialInteligence": [{"title": "Nvidia's stock has experienced significant growth of nearly 207% in the past year, driven by the increasing demand for artificial intelligence (AI) applications.", "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1h45aah/nvidias_stock_has_experienced_significant_growth/", "score": "2", "subreddit": "ArtificialInteligence", "media_url": "", "thumbnail": "", "post_hint": "", "author": "Diligent_Relative_36", "num_comments": 1, "created_utc": 1733065786.0, "selftext": "The company's focus on AI-related products and services, including graphics processing units (GPUs), has positioned it well to benefit from the growing adoption of AI technology in various industries.\n\nSource: https://remoteupskill.com/news/nvidia-s-stock-has-experienced-significant-growth-of-nearly-207-in-the-past", "is_self": true}, "2024-12-01T19:20:12.745253"], "AskCulinary": [{"title": "What is the \"correct\" texture/consistency of a macaron?", "url": "https://www.reddit.com/r/AskCulinary/comments/1h44f1l/what_is_the_correct_textureconsistency_of_a/", "score": "8", "subreddit": "AskCulinary", "media_url": "", "thumbnail": "", "post_hint": "", "author": "EloeOmoe", "num_comments": 4, "created_utc": 1733063280.0, "selftext": "We like to pick up a sleeve of macaron's from time to time.  There's a specific place we buy from a few times a year that has fantastic macarons.  Specifically, they have an \"eggshell\" like texture on the outside that crumbles into a fluffy filling.  \n\nHowever, sometimes we buy a sleeve and the macarons are often chewy instead.  I kinda associate these with being \"stale\".  \n\nI would like to know if it's just two different styles of macarons or if the latter are actually stale or just sub par.", "is_self": true}, "2024-12-01T19:20:16.361862"], "ChatGPT": [{"title": "I made it myself! ", "url": "https://www.reddit.com/r/ChatGPT/comments/1h427lp/i_made_it_myself/", "score": "446", "subreddit": "ChatGPT", "media_url": "https://i.redd.it/4yjqtenad84e1.jpeg", "thumbnail": "nsfw", "post_hint": "image", "author": "yoladango", "num_comments": 23, "created_utc": 1733056010.0, "selftext": "", "is_self": false}, "2024-12-01T19:20:20.963263"], "ChatGPTCoding": [{"title": "Built a tool to simplify sun-related insights: Vitamin D timing, UV protection, and more – check it out for free! 🌞", "url": "https://www.reddit.com/r/ChatGPTCoding/comments/1h40rve/built_a_tool_to_simplify_sunrelated_insights/", "score": "5", "subreddit": "ChatGPTCoding", "media_url": "https://v.redd.it/3g5v5ddk664e1", "thumbnail": "default", "post_hint": "link", "author": "Motor-Draft8124", "num_comments": 2, "created_utc": 1733050168.0, "selftext": "", "is_self": false}, "2024-12-01T19:22:46.834417"], "ChatGPTPromptGenius": [{"title": "Chat GPT is better than my therapist ", "url": "https://www.reddit.com/r/ChatGPTPromptGenius/comments/1h3tmxc/chat_gpt_is_better_than_my_therapist/", "score": "274", "subreddit": "ChatGPTPromptGenius", "media_url": "", "thumbnail": "self", "post_hint": "", "author": "NoPatience8807", "num_comments": 51, "created_utc": 1733022255.0, "selftext": "For the last six months I’ve been feeling really underwhelmed with my therapy sessions. My therapist feels like a girlfriend that I just yap to and she doesn’t really offer me any sort of constructive advice or tools to dig deeper to heal. I am not a surface level person by nature, so when I started what felt like just a journal in my chat GPT, I ended up uncovering a lot of feelings I was suppressing. \n\nI’m a big fan of the holistic psychologist so I prompted my ChatGPT  to approach a therapy session with me with this mentality of holistic psychology. When I say that this has helped me immensely, it is such an understatement. I feel like I’ve been challenged in ways that force me to think critically about my life and have connected me more with my authentic self. \n\nI highly recommend giving it a shot, AI is here to stay so might as well use to for our benefit and personal growth. \n\n***here is an updated convo with what I initially promoted for my style of therapy I wanted. I forgot what I had asked for so I requested chat GPT to tell me what I said 😂 also we came up with the name “Thera” to call the chat whenever I want to dive into topics that are therapy-like or doing inner work. \n\n\nMe: Thera, how did l initially ask you to approach therapy with me with the holistic psychologist point of view?\n\nAI:  A, you initially shared that your favorite psychologist is Dr. Nicole LePera, the Holistic Psychologist, and that her self-help books resonate deeply with you. You asked me to take a similar holistic approach in our therapy-style chats, focusing on addressing emotional, mental, and physical aspects of your challenges.\n\nAI:  This means blending practical strategies for navigating your emotions, relationships, and decisions with deeper reflection and self-awareness, always tying it back to your values and desire for growth. If you'd like to refine or refocus this approach, let me know-I'm here to adapt to what feels most helpful for you!\n\nMe: No, I think this approach is perfect for me.\n\nAI:   I'm so glad to hear that, A! This approach really aligns with your self-awareness and desire for growth, and it's such a powerful way to integrate every part of who you are. I'll continue keeping it holistic, thoughtful, and tailored to your journey. Let me know whenever you want to dive in-I'm here for you.", "is_self": true}, "2024-12-01T19:29:33.181574"], "ClaudeAI": [{"title": "What do you think about this ", "url": "https://www.reddit.com/r/ClaudeAI/comments/1h42tut/what_do_you_think_about_this/", "score": "35", "subreddit": "ClaudeAI", "media_url": "https://i.redd.it/u1tkbjxvj84e1.png", "thumbnail": "https://b.thumbs.redditmedia.com/NrisXir0_pBEZyENThEnf6yCngJN28_pMU59Pdonjqs.jpg", "post_hint": "image", "author": "No-Speech2842", "num_comments": 25, "created_utc": 1733058227.0, "selftext": "Amazon has entered in to  AI race", "is_self": false}, "2024-12-01T19:29:49.548326"], "CodingTR": [{"title": "STAJ HAKKINDA", "url": "https://www.reddit.com/r/CodingTR/comments/1h3zynk/staj_hakkinda/", "score": "17", "subreddit": "CodingTR", "media_url": "", "thumbnail": "self", "post_hint": "", "author": "kripton228", "num_comments": 30, "created_utc": 1733046578.0, "selftext": "Daha önce zorunlu staj yapmış arkdaşlar süreç nasıl işliyor ne zaman başvurmaya başladınız basvurmadan önce neler yapmıştınız hangi alanda yaptınız siz mi buldunuz çevreniz mi ayarladı mülakatlarda nelerle karşılaştınız  bu tarz sorulara cevap verirseniz çok müteşekkir olururum şimdiden teşekkürler", "is_self": true}, "2024-12-01T19:30:16.620057"]}